kamer71372/nRF52_Insole/main.c
// Ble data size packet1(243) + packet2(243) + packet3(13) total is 499 bytes
// in int16 Ble data size packet1(122) + packet2(122) + packet3(7) 251
#define ble_data_size 499
#define ble_packet_size 242
uint16_t ble_packet_length = 242;

// Define Device Name

/* SPI ---------------------------------------*/
#define SPI_SS_PIN 		14
#define SPI_MISO_PIN 	24
#define SPI_MOSI_PIN 	37
#define SPI_SCK_PIN 	33


#define SPI_INSTANCE  0 /**< SPI instance index. */
static const nrf_drv_spi_t spi = NRF_DRV_SPI_INSTANCE(SPI_INSTANCE);  /**< SPI instance. */
static volatile bool spi_xfer_done;  /**< Flag used to indicate that SPI instance completed the transfer. */


//insole data
uint8_t sensor_num 		  = 15;
uint8_t force_number 	  = 0;
float		res_force[15]	= {0}; //力量原始值
float 	force_temp[15] = {0}; //演算法後力量值
float   force_interval  = 0.5;
uint8_t force_count     = 11;


//BLE send data
uint8_t 	StringSelect;
//uint8_t data_buffer[256]= {0}; 
uint8_t 	length;
uint8_t 	counter;
uint8_t 	ble_force_buffer[498] = {0};

uint8_t 	data_buffer[ble_data_size]; // BLE data packet buffer 
uint8_t 	packet_count = (ble_data_size / ble_packet_size) +1; // BLE packet count
int a = 0;

/* define Pcap04 OPcode-------------------------*/
#define Pcap04_Read_Result 				0x40
uint8_t WR_MEM[2] 						= {0xA0,0x00};
uint8_t WR_CONFIG[2]		 			= {0xA3,0xC0};
uint8_t POR[1]								= {0x88};
uint8_t INITIALIZE[1]					= {0x8A};
uint8_t CDC_START[1]					= {0x8C};
uint8_t TEST[2]								= {0x7E,0x00};
uint8_t RD_MEM[2]							= {0x20,0x00};
//uint8_t Pcap04_Read_Result[1]	= {0x40};

// Pcap Init data buffer
uint8_t Test_buff[2]					= {0};
uint8_t read_mem[1024] 				= {0};

//Pcap Result buffer
uint8_t 	data_buff[4]		= {0x00}; //SPI Read pcap value
volatile float 		RES_data_buff[3] 									= {0}; // Print Pcap capcaitance channel data
volatile float    RES_data_buff_fake[3]							= {0}; // Print Pcap capcaitance fake value channel data and NOT USE FOR CURRENT VALUE
float 						per_channel_data[15] 					   	= {0}; // Print Every channel Result in Floating
float 						per_channel_data_buffer[15] 			= {0}; // Print Every channel Result in Floating
float 						first_per_channel_data[15] 				= {0}; // First Print Every channel Result in Floating
//volatile 					uint32_t u32_buff[3] 							= {0};
//uint32_t 					u32_res[100] 											= {0};
uint8_t 					cap_high 													= 0; // To ble data transfer integer buffer
float 						cap_low 													= 0; // To ble data transfer decimat buffer
uint8_t 					ble_data_buffer[243] 							= {0};
uint16_t 					b 																= 0; 

float prev[15] 					={0};//存當前感測器前一點數據
float current[15] 			={0};//存當前感測器數據
float final[15] 				={0};//存當前感測器處理後數據
float zero_sum[15] 			={0};//存當0點感測器數值加總
float first_buff[15] 		={0};//存當0點感測器初始暫存

float force_tmp[15] 		= {0};
uint8_t count_temp 			= 0;

//cal table ratio array
float cal_temp[15][11] = {0};

/*BNO055 ---------------------------------------*/
#define BNO055_ADDRESS 						0x28
#define BNO055_OPR_MODE_ADDR 			0x3D
#define BNO055_SYS_TRIGGER_ADDR 	0x3F
#define BNO055_PWR_MODE_ADDR 			0x3E
#define BNO055_PAGE_ID_ADDR 			0x07
#define BNO055_UNIT_SEL_ADDR 			0x3B
#define BNO055_CHIP_ID_ADDR 			0x00
#define OPERATION_MODE_CONFIG 		0x00
#define OPERATION_MODE_NDOF 			0x0C
#define POWER_MODE_NORMAL 				0x00
#define ACC_DATA 									0x08
#define MAG_DATA								 	0x0E
#define GYR_DATA 									0x14 
#define EULER_DATA 								0x1A  // Yaw Pitch Row
#define QUAT_DATA 								0x20 //QUAT
#define GRAVITY_DATA 							0x2E
#define LINEAR_ACCEL_DATA 				0x28
#define BNO055_CALIB_STAT 				0x35 //校正狀態讀取

//IMU calibration count number
#define ACC_CAL_NUMBER 						100
#define GYRO_CAL_NUMBER 					100
#define MAG_CAL_NUMBER            100

//BNO055 para
int16_t acc_x, acc_y, acc_z 			= 0;
int16_t gyro_x, gyro_y, gyro_z 		= 0;
int16_t mag_x, mag_y, mag_z 			= 0;
int16_t yaw, roll, pitch  				= 0;
int16_t gx, gy, gz								= 0;
int16_t qx, qy, qz, qw						= 0;
bool 		init_data; //confirm bno055 init

int16_t acc_x_cal[ACC_CAL_NUMBER];
int16_t acc_y_cal[ACC_CAL_NUMBER];
int16_t acc_z_cal[ACC_CAL_NUMBER];
int16_t gyro_x_cal[GYRO_CAL_NUMBER];
int16_t gyro_y_cal[GYRO_CAL_NUMBER];
int16_t gyro_z_cal[GYRO_CAL_NUMBER];
int16_t mag_x_cal[MAG_CAL_NUMBER];
int16_t mag_y_cal[MAG_CAL_NUMBER];
int16_t mag_z_cal[MAG_CAL_NUMBER];

int16_t calibrate_acc_x 	= 0;
int16_t calibrate_acc_y 	= 0;
int16_t calibrate_acc_z 	= 0;
int16_t calibrate_gyro_x 	= 0;
int16_t calibrate_gyro_y 	= 0;
int16_t calibrate_gyro_z 	= 0;
int16_t calibrate_mag_x	 	= 0;
int16_t calibrate_mag_y 	= 0;
int16_t calibrate_mag_z 	= 0;

//after unit transfer imu data
float ACC_X, ACC_Y, ACC_Z 				= 0;
float GYRO_X, GYRO_Y, GYRO_Z 			= 0;
float MAG_X, MAG_Y, MAG_Z 				= 0;
float YAW, ROLL, PITCH  					= 0;
float GX, GY, GZ									= 0;
float QX, QY, QZ, QW							= 0;
uint8_t chip_ID = 0;
uint8_t page= 0;





// Pcap config
static uint8_t Pcap04_Config [] =
{
     0x1D,0x00,0xF8,0x10//0,1,2,3        //
     ,0xB1,0x00,0x0C,0x01//4,5,6,7       //  4(11(6要0F才可)或91(內建ref))
     ,0x00,0x01,0x00,0x00//8,9,10,11     //
     ,0x00,0x04,0xFF,0x03//12,13,14,15   //  15(0x04 CDC fake*1)
     ,0x00,0x50,0x00,0x00//16,17,18,19
     ,0x00,0x01,0x50,0x30//20,21,22,23
     ,0x73,0x04,0x50,0x00//24,25,26,27
     ,0x5A,0x00,0x82,0x08//28,29,30,31   //30(RDC觸發)
     ,0x08,0x00,0x47,0x40//32,33,34,35
     ,0x00,0x00,0x00,0x71//36,37,38,39
     ,0x00,0x00,0x08,0x00//40,41,42,43
     ,0x00,0x00,0x00,0x01//44,45,46,47
     ,0x00,0x00,0x00,0x00//48,49,50,51

 };


// Pcpa firmware 
uint8_t PCAP04_Firmware[1024] =
{
0x24,0x05,0xA0,0x01,0x20,0x55,0x42,0x5C,0x48,0xB1,0x07,0x92,0x02,0x20,0x13,0x02
,0x20,0x93,0x02,0xB2,0x02,0x78,0x20,0x54,0xB3,0x06,0x91,0x00,0x7F,0x20,0x86,0x20
,0x54,0xB6,0x03,0x72,0x62,0x20,0x54,0xB7,0x00,0x00,0x42,0x5C,0xA1,0x00,0x49,0xB0
,0x00,0x49,0x40,0xAB,0x5D,0x92,0x1C,0x90,0x02,0x7F,0x20,0x86,0x66,0x67,0x76,0x77
,0x66,0x7A,0xCF,0xCD,0xE6,0x43,0xF1,0x44,0x29,0xE0,0x7A,0xDC,0xE7,0x41,0x32,0xAA
,0x01,0x99,0xFD,0x7B,0x01,0x7A,0xCF,0xEB,0xE6,0x43,0xF1,0x44,0x29,0xE0,0x7A,0xC1
,0xE7,0x41,0x32,0x6A,0xDE,0x44,0x7A,0xCF,0xEA,0xE6,0x43,0xF1,0x44,0x29,0xE0,0x6A
,0xDF,0x44,0x7A,0xC4,0xE7,0x41,0x32,0xAB,0x05,0x7A,0xC1,0xE1,0x43,0xE0,0x3A,0x7A
,0xC0,0xE1,0x43,0xE0,0x3A,0x02,0x7A,0xCF,0xE6,0xE6,0x43,0xF1,0x44,0x29,0xE0,0x7A
,0xEF,0x44,0x02,0x20,0x9D,0x84,0x01,0x21,0x2E,0x21,0x74,0x20,0x37,0xC8,0x7A,0xE7
,0x43,0x49,0x11,0x6A,0xD4,0x44,0x7A,0xC1,0xD8,0xE6,0x43,0xE9,0x44,0x1C,0x43,0x13
,0xAB,0x63,0x6A,0xDE,0x41,0xAB,0x0B,0x46,0x46,0x46,0x7A,0xDF,0xFF,0xFF,0xFF,0xFF
,0xE3,0x41,0x32,0x1C,0x44,0xE9,0x13,0x6A,0xD4,0x13,0x41,0xAA,0xDF,0x7A,0xC5,0xE1
,0x43,0x49,0xE0,0x34,0x7A,0xCF,0xE3,0xE6,0x43,0xF1,0x44,0x29,0xE0,0xDB,0xC0,0x27
,0xE5,0x6A,0xDF,0x43,0x7A,0xC8,0xE7,0x41,0x30,0xAB,0x03,0x86,0x01,0x92,0x37,0x7A
,0xC6,0xE7,0x41,0x7A,0xFA,0xE7,0x43,0xEA,0x44,0x7A,0xC1,0xE1,0xE6,0x43,0xE9,0x44
,0x25,0xE0,0x7A,0xC6,0xE7,0x41,0x7A,0xFA,0xE7,0x43,0xEA,0x44,0x7A,0xC0,0xE7,0x43
,0xE9,0x44,0x25,0xE0,0x92,0x10,0x7A,0xE1,0x44,0xE2,0x44,0xE3,0x44,0xE4,0x44,0xE5
,0x44,0xE6,0x44,0xE7,0x44,0xE8,0x44,0xC1,0xD8,0x24,0x3E,0x92,0xFF,0x02,0x7A,0xCF
,0xD7,0xE6,0x43,0xF1,0x44,0x7A,0xD0,0xE7,0x43,0x2A,0x2A,0x32,0xAB,0x03,0x42,0x5C  
,0x92,0x03,0x7A,0xC0,0xE1,0x43,0xD9,0x27,0x90,0x6A,0xDF,0x43,0x7A,0xC8,0xE7,0x41
,0x32,0xAB,0x03,0x86,0x01,0x92,0x11,0x7A,0xC2,0x43,0x7A,0xE7,0x44,0x6A,0xC6,0x44
,0x7A,0xC3,0x43,0x7A,0xE8,0x44,0x6A,0xC7,0x44,0xC1,0xD4,0x24,0x57,0x7A,0xC8,0xE1
,0x43,0xE0,0x3A,0x02,0x7A,0xCF,0xE7,0xE6,0x43,0xF1,0x44,0x29,0xE0,0x7A,0xC7,0xE1
,0x41,0x6A,0xD4,0x45,0x5A,0x25,0x36,0x46,0x46,0x46,0x46,0x7A,0xE9,0x44,0x7A,0xC0
,0xE7,0x43,0x55,0x7A,0xEA,0x45,0x7A,0xE9,0x51,0x1C,0x43,0x6A,0xCA,0x44,0x1D,0x43
,0x6A,0xCB,0x44,0x7A,0xC1,0xCA,0xE6,0x43,0xE9,0x44,0x7A,0xC1,0xE1,0x43,0x7A,0xCC
,0xE0,0xE6,0x41,0x2C,0x42,0x7A,0xC5,0xE1,0x43,0x49,0xE0,0x34,0x7A,0xC1,0xCC,0xE6
,0x43,0xE9,0x44,0x7A,0xC1,0xE1,0x43,0x2C,0x70,0x7A,0xCC,0x43,0x7A,0xCF,0x44,0x7A
,0xCD,0x43,0x7A,0xCE,0x44,0x6A,0xCA,0x43,0xC1,0xCA,0x7A,0xE6,0x41,0xE9,0x45,0x2B
,0xAE,0xEE,0x44,0x7A,0xC1,0xCA,0xE6,0x43,0xE9,0x44,0x7A,0xC1,0xE1,0x43,0x7A,0xCC
,0xEC,0xE6,0x41,0x2C,0x42,0x7A,0xC5,0xE1,0x43,0x49,0xE0,0x34,0x7A,0xC1,0xCC,0xE6
,0x43,0xE9,0x44,0x7A,0xC1,0xE1,0x43,0x2C,0x70,0x7A,0xCC,0x43,0x7A,0xCF,0x44,0x7A
,0xCD,0x43,0x7A,0xCE,0x44,0x6A,0xCB,0x43,0xC1,0xCA,0x7A,0xE6,0x41,0xE9,0x45,0x2B
,0xAE,0xED,0x44,0x02,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x35,0x33,0x33,0x07,0xCD,0xCC,0xCC,0x08,0x01,0x00,0xFE,0x03,0x66,0x66,0x66,0x01
,0x33,0x33,0x33,0x02,0x01,0x00,0xFE,0x03,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
,0x1D,0x00,0x08,0x10,0x31,0x00,0x3F,0x20,0x00,0xD0,0x07,0x00,0x00,0x08,0xFF,0x03
,0x00,0x24,0x00,0x00,0x00,0x01,0x50,0x30,0x73,0x04,0x50,0x08,0x5A,0x00,0x82,0x08
,0x08,0x00,0x47,0x40,0x00,0x00,0x00,0x71,0x00,0x00,0x08,0x00,0x00,0x00,0x00,0x01
,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00 //1024
};

