kamer71372/nRF52_Insole/main.c
//MUX Truth Table

uint8_t sensor_switch[] = 
{
	0xF0, //0  //1111 0000 
  0xE1, //1  //1110 0001
  0xD2, //2  //1101 0010 
  0xC3, //3  //1100 0011 
  0xB4, //4  //1011 0100 
  0xA5, //5  //1010 0101 
  0x96, //6  //1001 0110 
  0x87, //7  //1000 0111 
  0x78, //8  //0111 1000 
  0x69, //9  //0110 1001 
  0x5A, //10 //0101 1010 
  0x4B, //11 //0100 1011 
  0x3C, //12 //0011 1100 
  0x2D, //13 //0010 1101 
  0x1E, //14 //0001 1110 
  0x0F, //15 //0000 1111 
};

//insole calibration data
/*
9 point represent calibration force that unit is bar
0.3 * count = force
*/
float point[15][11] = {
    {0.0000, 0.3253, 0.4232, 0.5002, 0.5774, 0.6479, 0.7070, 0.7688, 0.8248, 0.8803, 0.9253},  // Sensor 1
    {0.0000, 3.9239, 5.1282, 5.7062, 6.1271, 6.4451, 6.6589, 6.8417, 6.9800, 7.1026, 7.2016},  // Sensor 2
    {0.0000, 4.9506, 6.3735, 7.0985, 7.6602, 8.0706, 8.3397, 8.5652, 8.7207, 8.8541, 8.9597},  // Sensor 3
    {0.0000, 1.1646, 1.7955, 2.0542, 2.2382, 2.3700, 2.4634, 2.5489, 2.6142, 2.6690, 2.7211},  // Sensor 4
    {0.0000, 1.7681, 2.1219, 2.3087, 2.4708, 2.6076, 2.7129, 2.8095, 2.8894, 2.9673, 3.0345},  // Sensor 5
    {0.0000, 2.0108, 2.5726, 2.8609, 3.1014, 3.2782, 3.4054, 3.5183, 3.6053, 3.6859, 3.7523},  // Sensor 6
    {0.0000, 1.9656, 2.5380, 2.8041, 3.0181, 3.2048, 3.3260, 3.4520, 3.5419, 3.6362, 3.7119},  // Sensor 7
    {0.0000, 3.9504, 4.8953, 5.4682, 5.9257, 6.2320, 6.4243, 6.5849, 6.7136, 6.8232, 6.9157},  // Sensor 8
    {0.0000, 6.0318, 7.3629, 7.8742, 8.2365, 8.5003, 8.6775, 8.8304, 8.9645, 9.0813, 9.1807},  // Sensor 9
    {0.0000, 3.6717, 4.9017, 5.3909, 5.7301, 5.9662, 6.1047, 6.2241, 6.3161, 6.3871, 6.4489},  // Sensor 10
    {0.0000, 0.6535, 0.8154, 0.9081, 1.0197, 1.1176, 1.1930, 1.2758, 1.3482, 1.4245, 1.4912},  // Sensor 11
    {0.0000, 0.3222, 0.4615, 0.5521, 0.6423, 0.7195, 0.7770, 0.8339, 0.8803, 0.9299, 0.9678},  // Sensor 12
    {0.0000, 0.2039, 0.3271, 0.4027, 0.4908, 0.5830, 0.6545, 0.7307, 0.8047, 0.8809, 0.9357},  // Sensor 13
    {0.0000, 0.1671, 0.2328, 0.2733, 0.3063, 0.3311, 0.3504, 0.3749, 0.3889, 0.4064, 0.4208},  // Sensor 14
    {0.0000, 0.1988, 0.3180, 0.3823, 0.4517, 0.5171, 0.5739, 0.6357, 0.6864, 0.7335, 0.7776}  // Sensor 15
};

void cal_table_init(){
	
	float cal_ratio = 0.78;
	for(int n=0; n<15; n++)
	{
		for(int i=0; i<force_count; i++)
		{
			if(n>=1 && n<=9)
			{
				cal_temp[n][i] = cal_ratio * point[n][i];
				point[n][i] = cal_temp[n][i];
			}
		}
	}
}
	
void MUXswitch(uint8_t sensor_adr){ 

	//MUX1_A0 to MUX1_A3 , MUX0_A0 to MUX0_A3
  if(sensor_adr      & 0x01) nrf_gpio_pin_set(8); 	else nrf_gpio_pin_clear(8);
  if(sensor_adr >> 1 & 0x01) nrf_gpio_pin_set(4); 	else nrf_gpio_pin_clear(4);
  if(sensor_adr >> 2 & 0x01) nrf_gpio_pin_set(7); 	else nrf_gpio_pin_clear(7);
  if(sensor_adr >> 3 & 0x01) nrf_gpio_pin_set(5); 	else nrf_gpio_pin_clear(5);
  if(sensor_adr >> 4 & 0x01) nrf_gpio_pin_set(26); 	else nrf_gpio_pin_clear(26);
  if(sensor_adr >> 5 & 0x01) nrf_gpio_pin_set(16); 	else nrf_gpio_pin_clear(16);
  if(sensor_adr >> 6 & 0x01) nrf_gpio_pin_set(11); 	else nrf_gpio_pin_clear(11);
  if(sensor_adr >> 7 & 0x01) nrf_gpio_pin_set(32); 	else nrf_gpio_pin_clear(32);
  //nrf_delay_us(680);
}

void ADG706_Trigger()
{
	nrf_gpio_cfg_output(8);
	nrf_gpio_cfg_output(4);
	nrf_gpio_cfg_output(7);
	nrf_gpio_cfg_output(5);
	nrf_gpio_cfg_output(26);
	nrf_gpio_cfg_output(16);
	nrf_gpio_cfg_output(11);
	nrf_gpio_cfg_output(32);
}

//setup bno055 I2C write
void bno055_write(uint8_t reg, uint8_t val)
{
	twi_write_register(BNO055_ADDRESS, reg, val);
}

//setup bno055 I2C read
uint8_t bno055_read(uint8_t reg)
{
	return twi_read_register(BNO055_ADDRESS, reg);
}

//bno055 init
void bno055_init() 
{
	twi_write_register(BNO055_ADDRESS, BNO055_PAGE_ID_ADDR, 0x00);
	//step1 mode set to config mode
	bno055_write(BNO055_OPR_MODE_ADDR, OPERATION_MODE_CONFIG);
	nrf_delay_ms(25);
	//step2 
	bno055_write(BNO055_SYS_TRIGGER_ADDR, 0x20);
	nrf_delay_ms(650);
	//step3 check bno055 chip 
	uint8_t id = 0x00;
	for(int i=0; i<200; i++){
		id = bno055_read(BNO055_CHIP_ID_ADDR);
		if(id == 0xA0) break;
		nrf_delay_ms(10);
	}
	if(id != 0xA0){
		NRF_LOG_INFO("BNO055 CHIP ID ERROR")
		chip_ID = id;
	}
	page = twi_read_register(BNO055_ADDRESS, 0x07);
	//step4 power reset
	bno055_write(BNO055_OPR_MODE_ADDR, BNO055_PWR_MODE_ADDR);
	nrf_delay_ms(10);
	//step5 confirm page id is 0.
	bno055_write(BNO055_PAGE_ID_ADDR, 0x00);
	//step6 
	bno055_write(BNO055_UNIT_SEL_ADDR, 0x00);
	//step7 use external crystal
	bno055_write(BNO055_SYS_TRIGGER_ADDR, 0x8F);
	nrf_delay_ms(10);
	//step8 mode set to NDOF mode
	bno055_write(BNO055_OPR_MODE_ADDR, OPERATION_MODE_NDOF);
	nrf_delay_ms(25);
	init_data = true;
	
}

void bno055_read_acc_xyz(int16_t *ax, int16_t *ay, int16_t *az)
{
	uint8_t data_buf[6];
	twi_read_register_block(BNO055_ADDRESS, ACC_DATA, data_buf, 6);
	*ax = (int16_t)( data_buf[0] | data_buf[1] <<8 );
	*ay = (int16_t)( data_buf[2] | data_buf[3] <<8 );
	*az = (int16_t)( data_buf[4] | data_buf[5] <<8 );
}

void bno055_read_gyro_xyz(int16_t *gyx, int16_t *gyy, int16_t *gyz)
{
	uint8_t data_buf[6];
	twi_read_register_block(BNO055_ADDRESS, GYR_DATA, data_buf, 6);
	*gyx = (int16_t)( data_buf[0] | data_buf[1] <<8 );
	*gyy = (int16_t)( data_buf[2] | data_buf[3] <<8 );
	*gyz = (int16_t)( data_buf[4] | data_buf[5] <<8 );
}

void bno055_read_mag_xyz(int16_t *mx, int16_t *my, int16_t *mz)
{
	uint8_t data_buf[6];
	twi_read_register_block(BNO055_ADDRESS, MAG_DATA, data_buf, 6);
	*mx = (int16_t)( data_buf[0] | data_buf[1] <<8 );
	*my = (int16_t)( data_buf[2] | data_buf[3] <<8 );
	*mz = (int16_t)( data_buf[4] | data_buf[5] <<8 );
}

void bno055_read_quat(int16_t *qw, int16_t *qx, int16_t *qy, int16_t *qz)
{
	uint8_t data_buf[8];
	twi_read_register_block(BNO055_ADDRESS, QUAT_DATA, data_buf, 8);
	*qw = (int16_t)( data_buf[0] | data_buf[1] <<8 );
	*qx = (int16_t)( data_buf[2] | data_buf[3] <<8 );
	*qy = (int16_t)( data_buf[4] | data_buf[5] <<8 );
	*qz = (int16_t)( data_buf[6] | data_buf[7] <<8 );
}

void bno055_read_euler(int16_t *yaw, int16_t *roll, int16_t *pitch)
{
	uint8_t data_buf[6];
	twi_read_register_block(BNO055_ADDRESS, QUAT_DATA, data_buf, 6);
	*yaw    = (int16_t)( data_buf[0] | data_buf[1] <<8 );
	*roll   = (int16_t)( data_buf[2] | data_buf[3] <<8 );
	*pitch  = (int16_t)( data_buf[4] | data_buf[5] <<8 );
}

void bno055_read_grav(int16_t *gx, int16_t *gy, int16_t *gz)
{
	uint8_t data_buf[6];
	twi_read_register_block(BNO055_ADDRESS, GRAVITY_DATA, data_buf, 6);
	*gx = (int16_t)( data_buf[0] | data_buf[1] <<8 );
	*gy = (int16_t)( data_buf[2] | data_buf[3] <<8 );
	*gz = (int16_t)( data_buf[4] | data_buf[5] <<8 );
}

