kamer71372/nRF52_Insole/main.c
/* Pcap Function ---------*/
/*
Pcap04 SPI Test
*/
void Pcap04_Test()
{
	nrf_gpio_pin_clear(14);
	nrf_delay_ms(1);
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, TEST, 2, Test_buff, 2));
	while(!spi_xfer_done);	
	nrf_delay_ms(1);
	nrf_gpio_pin_set(14);
	
}

/*
Power04 Reset
*/
void Pcap04_Power_Reset()
{
	nrf_gpio_pin_clear(14);
	nrf_delay_ms(1);
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, POR, 1, 0, 0));
	while(!spi_xfer_done);	
	nrf_delay_ms(1);
	nrf_gpio_pin_set(14);
}

/*
Pcap04 CDC Start
*/
void Pcap04_CDCStart()
{
	nrf_gpio_pin_clear(14);
	nrf_delay_ms(1);
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, CDC_START, 1, 0, 0));
	while(!spi_xfer_done);	
	nrf_delay_us(280);
	nrf_gpio_pin_set(14);
}

/*
Pcap04 Initialize
*/
void Pcap04_Initialize()
{
	nrf_gpio_pin_clear(14);
	nrf_delay_ms(1);
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, INITIALIZE, 1, 0, 0));
	while(!spi_xfer_done);	
	nrf_delay_ms(1);
	nrf_gpio_pin_set(14);
}

/*
Pcap04 write firmware
*/
void Pcap04_WriteFirmware(uint8_t *data)
{
	nrf_gpio_pin_clear(14);
	nrf_delay_ms(1);
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, WR_MEM, 2, 0, 0));
	nrf_delay_ms(1);
	for(int i = 0; i<1024; i++)
	{
		spi_xfer_done = false;
		APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, &data[i], 1, 0, 0));
		//nrf_delay_us(1);
		while(!spi_xfer_done);	
	}
	nrf_delay_ms(1);
	nrf_gpio_pin_set(14);
}

/*
Pcap04 Read firmware
*/
void Pcap04_ReadFirmware(uint8_t *data)
{
	
	nrf_gpio_pin_clear(14);
	nrf_delay_ms(1);
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, RD_MEM, 2, 0, 0));
	while(!spi_xfer_done);	
	nrf_delay_ms(1);
	for(int i=0; i<1024; i++)
	{
		spi_xfer_done = false;
		APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, 0, 0, &data[i], 1));
		while(!spi_xfer_done);	
	}
	nrf_delay_ms(1);
	nrf_gpio_pin_set(14);
}
	
/*
Pcap04 Write Config
*/
void Write_Config(uint8_t *data)
{
	//Runbit off
	nrf_gpio_pin_clear(14);
	nrf_delay_ms(1);
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, WR_CONFIG, 2, 0, 0));
	while(!spi_xfer_done);
	uint8_t data_0[1] = {0x00};
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, data_0, 1, 0, 0));
	while(!spi_xfer_done);
	nrf_delay_ms(1);
	nrf_gpio_pin_set(14);
	nrf_delay_ms(1);//wait gpio keep high 1ms
	
	//Start Write Pcap config
	nrf_gpio_pin_clear(14);
	nrf_delay_ms(1);	
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, WR_CONFIG, 2, 0, 0));
	while(!spi_xfer_done);
	for(int i=0; i<48; i++)
	{
		spi_xfer_done = false;
		APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, &data[i], 1, 0, 0));
		while(!spi_xfer_done);	
	}
	nrf_delay_ms(1);
	nrf_gpio_pin_set(14);
	nrf_delay_ms(1);//wait gpio keep high 1ms
	
	//Runbit on
	nrf_gpio_pin_clear(14);
	nrf_delay_ms(1);
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, WR_CONFIG, 2, 0, 0));
	while(!spi_xfer_done);
	uint8_t data_1[1] = {0x01};
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, data_1, 1, 0, 0));
	while(!spi_xfer_done);
	nrf_delay_ms(1);
	nrf_gpio_pin_set(14);
}

/*
Pcap04 Init Step
*/
void Pcap04_Init_Tow()
{
	nrf_delay_ms(10);
	Pcap04_Power_Reset();
	
	nrf_delay_ms(10);
	Pcap04_WriteFirmware(PCAP04_Firmware);
	
	nrf_delay_ms(10);
	Write_Config(Pcap04_Config);
	
	nrf_delay_ms(10);
	Pcap04_Initialize();
	
	nrf_delay_ms(10);
	Pcap04_CDCStart();
	//nrf_delay_ms(10);
	
}

/*
Pcap04 Read Value
Read 4 bytes for capcitance, Send OPcode 0x40 and add channel value to OPcode.
*/
uint32_t Pcap04_Read_CDC_Result(uint8_t Num)
{
	uint8_t 	s_data[1] 			= {0x00};
  volatile 	uint32_t u32Val	= 0x00000000;
	
	nrf_gpio_pin_clear(14); // Start Read Value
	
	//If Num is 1 , Read Channel 1
	s_data[0] = Pcap04_Read_Result + (Num * 4);

	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, s_data, 1, 0, 0));
	while(!spi_xfer_done);
	
	//Read 4 bytes
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, 0, 0, data_buff, 4));
	while(!spi_xfer_done);
	//nrf_delay_us(1014);
	
	nrf_gpio_pin_set(14);//Read complete
	//nrf_delay_us(100);
	nrf_delay_us(1084);
	
	//combine 4 bytes as a value 
	u32Val |= (uint32_t)data_buff[3] << 24;
	u32Val |= (uint32_t)data_buff[2] << 16;
	u32Val |= (uint32_t)data_buff[1] <<  8;
	u32Val |= (uint32_t)data_buff[0];

	
	return u32Val;
}


/*
Pcap04 digital converte to capcitance
The first 5 bits in 32bits is integer and left 27 bits is fractional 
*/
float converte_data(uint32_t data)
{
	uint32_t 	integer			=0;
	uint32_t 	fractional	=0;
	float 		converted		=0;
	float 		j						=0;
	
	integer = (data >> 27) & 0x1F;
	fractional = data & 0x7FFFFFF;
  j = (float)(integer * 1.0);
  converted =(float)(fractional/134217794.1088971);
	converted = (float)(converted + j);
	return (float)converted;
}


/*
Pcap04 Read Value
Use Pcap04 Single floating mode that Channel 0 is REF capcitance Channel 1 is Test Channel,
Channel 2 is not use.
Pcap_Scan_fake is Repeat Value that same as Pcap_Scan() function value and do not count.
*/
void Pcap_Scan()
{
	volatile 				uint32_t Value[4] = {0};
  volatile float 	data[4] 					= {0};
	
	//收電容數位值
  //Value[0] = Pcap04_Read_CDC_Result(0); //測電容ref port
	Value[1] = Pcap04_Read_CDC_Result(1); //待測電容port
	
	//數位轉電容
  //data[0] = converte_data(Value[0]);
  data[1] = converte_data(Value[1]);
	
	//RES_data_buff[0]  = data[0];
  RES_data_buff[1] = data[1];
	
}

void Pcap_Scan_fake()
{
	volatile 				uint32_t Value[4] = {0};
  volatile float 	data[4] 					= {0};
	
	//收電容數位值
	Value[1] = Pcap04_Read_CDC_Result(1); //待測電容port
	
	//數位轉電容
  data[1] = converte_data(Value[1]);
  RES_data_buff_fake[1] = data[1];
	
}




/*
Search the Cap2force Table to find which force range the measured capacitance value falls into, 
then calculate and convert to find the closest value.
*/

//等待校正值表建立
void compute_weight()
{
	//Scan all sensor
	for(uint8_t n=0; n<15; n++)
	{
		//Scan all force interval
		for(int i=0; i<force_count; i++)
		{
						
			//if cap value match table, output the force that table represently.
			if(per_channel_data[n] == point[n][i])
			{
				res_force[n] = i * force_interval;
			}
			
			//if cap_value does not match table ,use interpolation.
			if(per_channel_data[n] >  point[n][i] && per_channel_data[n] <  point[n][i+1])
			{
				res_force[n] =( i + (per_channel_data[n] - point[n][i])/ (point[n][i+1] - point[n][i]) )* force_interval;
			} 
			
