kamer71372/nRF52_Insole/main.c
			//如果電容值小於最小值則用最小值計算
			if(per_channel_data[n] < point[n][0])
			{
				res_force[n] = 0 * force_interval;
			}
			
			//如果電容值大於最大值則用最大值計算		
			if(per_channel_data[n] > point[n][force_count - 1])
			{
				res_force[n] = (force_count-1) * force_interval;
			}
			//設定壓力值大小
			//if(res_force[n] <0.40)res_force[n] = 0;
			if(res_force[n] >5.0)res_force[n] = 5.0;
			
		}
	}
}

void point_transfer()
{
	for(int n=0; n<15; n++)
	{
		count_temp = n+1;
		if(count_temp == 15 ) count_temp = 0;
		force_tmp[n] = res_force[count_temp];
		res_force[n] = force_tmp[n];
	}
}

void force_convert_hex()
{
	float								n 					= 1000; 	//取小數點後2位
	volatile float 			round_force = 0; 	  //4捨5入存入變數
	volatile uint8_t 		force_int 	= 0;   	//力量值整數
	volatile uint8_t 		force_frac	= 0;		//力量值小數
	
	// 執行演算法
	//force_debug();
	//force_avg(); 
	
	//convert all sensor data
	for(int i=0; i<sensor_num; i++)
	{
		//有debug&avg演算法
		//round_force = round((float)force_temp[i] * n);
		round_force = (float)res_force[i] * n;
		//force_int   = round_force / n; //取整數
		//force_frac  = (int)round_force % n; //取餘數
		//ble_force_buffer[i] = (force_int << 8) | force_frac;
		force_int =  (((uint16_t)round_force) >> 8) & 0xFF;
		force_frac = (((uint16_t)round_force)     ) & 0xFF;
		
		ble_force_buffer[2*i+1] = force_int;
		ble_force_buffer[2*i] = force_frac;
	}
}


void Pcap_read_zeropoint_value()
{
  int16_t count = 0;
  float avg_value = 0; // 平均值變數
	float x_1[15] = {0};

  /*loop for insole sample test*/
	for(uint8_t i=0; i<15; i++)
	{
		MUXswitch(sensor_switch[i]);
					
		count = i;
    Pcap_Scan();        // Pcap04 Read Value
		first_buff[count] = RES_data_buff[1];
  }
}


void Read_Zeropoint()
{
	//Read zero point value
	//重複讀取15次
	for(int i=0; i<15; i++)
	{
		Pcap_read_zeropoint_value();
		
		//讀取所有感測器點
		for(int j=0; j<15; j++)
		{
			zero_sum[j] += first_buff[j];
		}
	}
	// 計算出0點平均值
	for(int i=0; i<15; i++)
	{
		first_per_channel_data[i] = zero_sum[i] / 15.0;
	}
}	



/*
Scan all sensor and read capacitance value then save it to buffer.
*/
void Pcap_read_value()
{
	int16_t count = 0;
	float x_1[15] = {0}; ///buff test data
	float alpha = 0.23;
	
	//loop for insole sample test
	for(uint8_t i=0; i<15; i++)
	{
		MUXswitch(sensor_switch[i]);

		//紀錄感測器序列
		count = i;
		
		//初次讀值

		Pcap_Scan(); //Pcap04 Read Value
		per_channel_data_buffer[count] = RES_data_buff[1];
				
		// 如果不同值才存資料
		current[count] = per_channel_data_buffer[count] - first_per_channel_data[count];
		
		// 執行濾波
		if (prev[count] == 0) {
			final[count] = current[count];  // 若 prev 為 0，則直接使用當前值
		} else {
			final[count] = alpha * current[count] + (1 - alpha) * prev[count];  // 濾波計算
		}
		
		//付值和存值
		prev[count] = final[count];
		per_channel_data[count] = final[count];
		
	}	
}

/**@brief Application main function.
 */
int main(void)
{
		NRF_LOG_INFO("init started.");
    bool erase_bonds;

    // Initialize.
    //uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
		twi_init(); //I2C init
	
	
		
		//Pcap04 SPI
		nrf_gpio_cfg_output(14); //SS
		nrf_gpio_cfg_output(37); //MOSI
		nrf_gpio_cfg_output(24); //MISO
		//nrf_gpio_cfg_output(33); //SCK

    nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
    spi_config.ss_pin   = NRF_DRV_SPI_PIN_NOT_USED; //14
    spi_config.miso_pin = SPI_MISO_PIN; //24
    spi_config.mosi_pin = SPI_MOSI_PIN; //37
    spi_config.sck_pin  = SPI_SCK_PIN; //33
		spi_config.frequency	= NRF_DRV_SPI_FREQ_125K;
		spi_config.mode 			= NRF_DRV_SPI_MODE_1;
		spi_config.bit_order	= NRF_DRV_SPI_BIT_ORDER_MSB_FIRST;
    APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler, NULL));
		nrf_gpio_cfg(SPI_SCK_PIN, NRF_GPIO_PIN_DIR_OUTPUT, NRF_GPIO_PIN_INPUT_DISCONNECT , NRF_GPIO_PIN_NOPULL, NRF_GPIO_PIN_H0H1, NRF_GPIO_PIN_NOSENSE);
		
			
		/* ble start------------*/
    
		// Start execution.
    /*printf("\r\nUART started.\r\n");*/
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();
		
		/*ble---------------------------*/
    StringSelect = Output_Select_Cap;
    counter = Default_Zero;
    length = Default_Zero;
		
		
		//ADG706 MUX pin set
		ADG706_Trigger();

		
		Pcap04_Test(); //Test Spi code
		if(Test_buff[1] == 0x11) //SPI Successful
		{
			Pcap04_Init_Tow(); //Init Pcap step
		}else{
			NRF_LOG_INFO("SPI ERROR.");
		}
		//nrf_delay_us(6800);
		
		bno055_init(); //bno055 initialize
		if(init_data == true){
			NRF_LOG_INFO("BNO055 initialize done");
		}else{
			NRF_LOG_INFO("BNO055 initilaize false")
		}
		
		
		//Read firmware to confirm
		//Pcap04_ReadFirmware(read_mem); 
		//nrf_delay_ms(10);
		
		//Read cushion zeropoint value
		Read_Zeropoint();
		cal_table_init();
		

    // Enter main loop.
    for (;;)
    {
      //idle_state_handle();
			
			//Start Read CDC data
			Pcap_read_value();
			//a++;
		
			//Find the Force represently.
			compute_weight();
			point_transfer();
			force_convert_hex();
			
			//Read imu data 
			bno055_read_acc_xyz(&acc_x, &acc_y, &acc_z); //read accel
			bno055_read_gyro_xyz(&gyro_x, &gyro_y, &gyro_z); //read gyro
			bno055_read_mag_xyz(&mag_x, &mag_y, &mag_z); //read mag
			bno055_read_euler(&yaw, &roll, &pitch); //read euler data
			bno055_read_grav(&gx, &gy, &gz); //read gravity
			
			//Convert IMU uints
			bno055_convert_data();
			
			
			if(StringSelect == Output_Select_Cap)
			{
				
				ble_packet_length = 54;
				//packet data transfer
				for (uint8_t i = 0; i < ble_packet_size; i++)
				{					
					ble_data_buffer[0] = 	0x21;
					ble_data_buffer[i + 1] = ble_force_buffer[i];
				}
			}
		
		uint16_t length = ( ble_packet_length + 1 ) ;
		uint32_t err_code = ble_nus_data_send(&m_nus, (uint8_t *)ble_data_buffer, &length, m_conn_handle);
		idle_state_handle();
		//nrf_delay_us(910);
	}
}


/**
 * @}
 */
